driver-tests/bpelse/dynamicpartnerlink/correlation/correlationJbi/test/invoke1Correlation/Input1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://seebeyond.com/correlation/"
                   xmlns="Invoke1parent">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
 <Invoke1parentOperation>
    <Invoke1parentPart>
       <Invoke1parentElement>
          <string>1.11</string>
       </Invoke1parentElement>
    </Invoke1parentPart>
 </Invoke1parentOperation>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>